jmeter.yml
execution:
  - scenario: get-hostname
    concurrency: 2
    ramp-up: 20s
    hold-for: 40s
    # distributed:
    #   - jmeter-slave01.cluster.local
    # throughput:
    #   local: null

scenarios:
  get-hostname:
    requests:
      - url: http://52.212.250.40:8080/hostname
        label: hostname
        method: GET
      # - url: https://appname.execute-api.eu-west-1.amazonaws.com/v1/hostname
      #   label: appname
      #   method: POST
      #   body:
      #     firstName: Bob
      #     lastName: John
      #   headers:
      #     Content-Type: application/json
      #     x-api-key: secret-key
  # csv-200-row:
  #   data-sources:
  #    - /tmp/test.csv
  #   requests:
  #     - label: test-xml
  #       url: https://api.local
  #       method: POST
  #       body-file: test-ext-request1.xml
  #       content-encoding: 'UTF-8'
  #       keepalive: true
  #       headers:
  #         Content-Type: 'application/xml'
  csv-200-row:
    data-sources:
      - /tmp/test.csv
    requests:
      - label: test-json
        url: https://api.local
        method: POST
        body:
          user:
            id: "${id}"
            name: "${name}"
          payload:
            city: "${city}"
            street: "${street}"
        content-encoding: 'UTF-8'
        keepalive: true
        headers:
          Content-Type: 'application/json'

settings:
  aggregator: consolidator
  check-interval: 3

modules:
  jmeter:
    # class: bzt.modules.jmeter.JMeterExecutor
    # path: ~/bin/jmeter
    gui: false
    # system-properties:
    #   javax.net.ssl.keyStore: ~/key.jks
    #   javax.net.ssl.keyStorePassword: secret
    properties:
      log_level: DEBUG
      # somehow there is no way to get this working properly
      jmeter.save.saveservice.assertion_results_failure_message: true

services:
  - module: shellexec
    post-process:
    - awk -F',' -v OFS=',' '$7 = $7 FS "failureMessage"' ${TAURUS_ARTIFACTS_DIR}/kpi.jtl > ${TAURUS_ARTIFACTS_DIR}/kpi_awk.csv
    - ~/.bzt/jmeter-taurus/4.0/bin/jmeter.sh -g ${TAURUS_ARTIFACTS_DIR}/kpi_awk.csv -o ${TAURUS_ARTIFACTS_DIR}/dashboard

# reporting:
#   - module: passfail
#     criteria:
#     - avg-rt>10ms for 7s, stop as failed
#     - hits of reserve >10 for 13s, continue as failed
#   - module: junit-xml
#     filename: ${TAURUS_ARTIFACTS_DIR}/junit.xml
#     data-source: pass-fail